# Data Cleaning and Preparation

## 7.1 Handling Missing Data

In [1]:
import pandas as pd
import numpy as np

In [2]:
string_data = pd.Series(['aardvark', 'artichoke', np.nan, 'avocado'])
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [3]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [4]:
string_data[0] = None
string_data

0         None
1    artichoke
2          NaN
3      avocado
dtype: object

In [5]:
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

* NA handling methods
![](7.1.1.PNG)

#### Filtering Out Missing Data

In [6]:
from numpy import nan as NA
data = pd.Series([1, NA, 3.5, NA, 7])
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [7]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [8]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

###### E

In [9]:
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA],[NA, NA, NA], [NA, 6.5, 3.]])
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [10]:
data.dropna()

     0    1    2
0  1.0  6.5  3.0

In [11]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [12]:
data[4] = NA
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [13]:
data.dropna(axis=1, how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

###### E

In [14]:
df = pd.DataFrame(np.random.randn(7, 3))
df

          0         1         2
0 -0.685962  0.603317  0.983651
1  1.795148 -0.365384 -1.363084
2  0.116322 -2.861286 -1.425843
3 -0.217205 -0.515202  0.710428
4 -0.294046  1.949940  0.863478
5  0.545892  1.590807 -0.154043
6  0.415944 -0.242124 -0.779675

In [15]:
df.iloc[:4, 1] = NA
df

          0         1         2
0 -0.685962       NaN  0.983651
1  1.795148       NaN -1.363084
2  0.116322       NaN -1.425843
3 -0.217205       NaN  0.710428
4 -0.294046  1.949940  0.863478
5  0.545892  1.590807 -0.154043
6  0.415944 -0.242124 -0.779675

In [16]:
df.iloc[:2, 2] = NA
df

          0         1         2
0 -0.685962       NaN       NaN
1  1.795148       NaN       NaN
2  0.116322       NaN -1.425843
3 -0.217205       NaN  0.710428
4 -0.294046  1.949940  0.863478
5  0.545892  1.590807 -0.154043
6  0.415944 -0.242124 -0.779675

In [17]:
df.dropna()

          0         1         2
4 -0.294046  1.949940  0.863478
5  0.545892  1.590807 -0.154043
6  0.415944 -0.242124 -0.779675

In [18]:
df.dropna(thresh=2)

          0         1         2
2  0.116322       NaN -1.425843
3 -0.217205       NaN  0.710428
4 -0.294046  1.949940  0.863478
5  0.545892  1.590807 -0.154043
6  0.415944 -0.242124 -0.779675

#### Filling In Missing Data

In [19]:
df

          0         1         2
0 -0.685962       NaN       NaN
1  1.795148       NaN       NaN
2  0.116322       NaN -1.425843
3 -0.217205       NaN  0.710428
4 -0.294046  1.949940  0.863478
5  0.545892  1.590807 -0.154043
6  0.415944 -0.242124 -0.779675

In [20]:
df.fillna(0)

          0         1         2
0 -0.685962  0.000000  0.000000
1  1.795148  0.000000  0.000000
2  0.116322  0.000000 -1.425843
3 -0.217205  0.000000  0.710428
4 -0.294046  1.949940  0.863478
5  0.545892  1.590807 -0.154043
6  0.415944 -0.242124 -0.779675

In [21]:
df.fillna({1: 0.5, 2: 0})

          0         1         2
0 -0.685962  0.500000  0.000000
1  1.795148  0.500000  0.000000
2  0.116322  0.500000 -1.425843
3 -0.217205  0.500000  0.710428
4 -0.294046  1.949940  0.863478
5  0.545892  1.590807 -0.154043
6  0.415944 -0.242124 -0.779675

In [22]:
_ = df.fillna(0, inplace=True)
df

          0         1         2
0 -0.685962  0.000000  0.000000
1  1.795148  0.000000  0.000000
2  0.116322  0.000000 -1.425843
3 -0.217205  0.000000  0.710428
4 -0.294046  1.949940  0.863478
5  0.545892  1.590807 -0.154043
6  0.415944 -0.242124 -0.779675

###### E

In [23]:
df = pd.DataFrame(np.random.randn(6, 3))
df.iloc[2:, 1] = NA
df.iloc[4:, 2] = NA
df

          0         1         2
0  0.653614  1.386570 -2.466556
1  1.101833 -0.525191 -1.078139
2 -1.062572       NaN -1.225182
3  2.260588       NaN -0.008409
4  0.196606       NaN       NaN
5  0.049939       NaN       NaN

In [24]:
df.fillna(method='ffill')

          0         1         2
0  0.653614  1.386570 -2.466556
1  1.101833 -0.525191 -1.078139
2 -1.062572 -0.525191 -1.225182
3  2.260588 -0.525191 -0.008409
4  0.196606 -0.525191 -0.008409
5  0.049939 -0.525191 -0.008409

In [25]:
df.fillna(method='ffill', limit=2)

          0         1         2
0  0.653614  1.386570 -2.466556
1  1.101833 -0.525191 -1.078139
2 -1.062572 -0.525191 -1.225182
3  2.260588 -0.525191 -0.008409
4  0.196606       NaN -0.008409
5  0.049939       NaN -0.008409

###### E

In [26]:
data = pd.Series([1., NA, 3.5, NA, 7])
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [27]:
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

* fillna function arguments
![](7.1.2.PNG)